/**/
"Cancel" = "ביטול";
/**/
"Delete" = "מחיקה";
/**/
"Open" = "פתח";
/**/
"Edit" = "עורך";
/**/
"Yes" = "כן";
/**/
"Finish" = "סיים";
/**/
"Done" = "בוצע";
/**/
"Save" = "שמור";
/**/
"Undo" = "בטל שינויים";
/**/
"Redo" = "בצע מחדש";
/**/
"OK" = "אישור";
/**/
"Yes Delete" = "מחק";


/*Geometry Edit Action Name*/
"Apply Geometry" = "החל גיאומטריה";
/*Geometry Edit Action Name*/
"Clear Geometry" = "נקה גיאומטריה";
/*Geometry Edit Action Name*/
"Delete Vertex" = "מחק נקודת מפנה";
/*Geometry Edit Action Name*/
"Insert Part" = "הכנס חלק";
/*Geometry Edit Action Name*/
"Insert Vertex" = "הוסף נקודת מפנה";
/*Geometry Edit Action Name*/
"Move Vertex" = "הזז נקודת מפנה";
/*Geometry Edit Action Name*/
"Remove Part" = "הסר חלק";

/*Collecting attachments*/
"Add" = "הוסף";
/*Collecting attachments*/
"Take Photo or Video" = "תמונה או וידאו";
/*Collecting attachments*/
"Choose From Library" = "בחר מספריה";
/*Collecting attachments*/
"Photo" = "תמונה";
/*Collecting attachments*/
"Video" = "וידאו";
/*Collecting attachments*/
"Save To Photo Library" = "שמור לספריית תמונות";
/*Collecting attachments*/
"Download" = "הורדה";

/*Date attribute*/
"Today" = "היום";

/**/
"Attachments" = "קבצים מקושרים";
"Attributes" = "מאפיינים";

/**/
"Open in Safari" = "פתח בספארי";

/* Please enter a numeric value between 0 and 5.*/
"Enter a number between %i and %i." = "הכנס מספר בין %i לבין %i.";

/* Please enter a numeric value between 0.5 and 5.0.*/
"Enter a number between %@ and %@." = "הכנס מספר בין %@ ל- %@.";

/* string length error, when user enters too many characters in string attribute editor:
  Too many characters.  Current: 512.  Allowed: 256 */
"Too many characters (%@)" = "יותר מדי תווים  (%@)";

/* When a number is entered outside the range */
"Number is outside the acceptable range." = "המספר מחוץ לטווח המותר.";

/* BLOB, RASTER, etc */
"Field type not supported" = "סוג השדה אינו נתמך";

/**/
"%d of %d" = "%d מתוך %d";

/**/
"Changing Feature Type" = "משנה את סוג הישות";
"You are changing the feature type, which may potentially overwrite some field values. Are you sure you want to do this?" =  "הינך משנה את סוג הישות, וזה עשוי לשנות ערכים בשדות. האם אתה בטוח שברצונך לבצע זאת?";

/**/
"Deleting Feature" = "מוחק ישות";
"Are you sure you want to delete this feature?" = "אתה בטוח שברצונך למחוק את הישות?";

/**/
"Data for pie chart is invalid" = "הנתונים עבור תרשים העוגה שגויים";
"No data to create a pie chart" = "אין נתונים ליצירת תרשים עוגה";
"No image to display" = "אין תמונה להצגה";

/**/
"Created by %@ seconds ago" = "נוצר על ידי %@ לפני מספר שניות";

/**/
"Created by %@ a minute ago" = "נוצר על ידי %@ לפני דקה";

/**/
"Edited by %@ seconds ago" = "נערך על ידי %@ לפני מספר שניות";

/**/
"Edited by %@ a minute ago" = "נערך על ידי %@ a לפני דקה";

/**/
"Created seconds ago" = "נוצר לפני מספר שניות";

/**/
"Created a minute ago" = "נוצר לפני דקה";

/**/
"Edited seconds ago" = "נערך לפני מספר שניות";

/**/
"Edited a minute ago" = "נערך לפני דקה";

/**/
"Created by %@ %d minutes ago" = "נוצר על ידי  %@ לפני %d שניות";

/**/
"Created by %@ an hour ago" = "נוצר על ידי  %@ לפני כשעה";

/**/
"Created by %@ %d hours ago" = "נוצר על ידי  %@ לפני %d  שעות";

/*"Created by %@ on ${weekDay} at ${formattedTime}"*/
"Created by %@ on %@ at %@ - day" = "נוצר על ידי %@ בתאריך %@ ב- %@";

/*"Created by %@ on ${formattedDate} at ${formattedTime}"*/
"Created by %@ on %@ at %@ - full" = "נוצר על ידי %@ בתאריך %@ ב- %@";

/**/
"Edited by %@ %d minutes ago" = "נערך על ידי  %@ לפני %d דקות";

/**/
"Edited by %@ an hour ago" = "נערך על ידי  %@ לפני כשעה";

/**/
"Edited by %@ %d hours ago" = "נערך על ידי  %@ לפני %d שעות";

/**/
"Edited by %@ on %@ at %@ - day" = "נערך על ידי %@ בתאריך %@ ב- %@";

/**/
"Edited by %@ on %@ at %@ - full" = "נערך על ידי %@ בתאריך %@ ב- %@";

/**/
"Created by %@" = "נוצר על ידי  %@";

/**/
"Edited by %@" = "נערך על ידי  %@";

/**/
"Created %d minutes ago" = "נוצר לפני %d דקות";

/**/
"Created an hour ago" = "נוצר לפני כשעה";

/**/
"Created %d hours ago" = "נוצר לפני %d שעות";

/*"Created on ${weekDay} at ${formattedTime}"*/
"Created on %@ at %@ - day" = "נוצר בתאריך  %@ ב- %@";

/*"Created on ${formattedDate} at ${formattedTime}"*/
"Created on %@ at %@ - full" = "נוצר בתאריך  %@ ב- %@";

/**/
"Edited %d minutes ago" = "נערך לפני %d דקות";

/**/
"Edited an hour ago" = "נערך לפני כשעה";

/**/
"Edited %d hours ago" = "נערך לפני %d שעות";

/*"Edited on ${weekDay} at ${formattedTime}"*/
"Edited on %@ at %@ - day" = "נערך בתאריך  %@ ב- %@";

/*"Edited on ${formattedDate} at ${formattedTime}"*/
"Edited on %@ at %@ - full" = "נערך בתאריך  %@ ב- %@";

/* Used to denote a required field */
"Required" = "דרוש";

/* Used for naming layers with no names */
"Layer %d" = "שכבה %d";

/* Geocoding: returned when locator cannot find address for given location */
"Cannot find address for location" = "לא מוצא כתובת למיקום";

/* Geocoding: returned when locator cannot find location for given address */
"Cannot find location for address" = "לא מוצא מיקום לכתובת";

/* Geocoding: core: used when address cannot be read */
"Cannot read address" = "לא ניתן לקרוא את הכתובת";

/* Geocoding: core: used when one of the locator files cannot be found */
"File not found" = "קובץ לא נמצא";

/* Geocoding: core: returned when locator cannot be loaded */
"Cannot load locator" = "לא ניתן לטעון מגדיר עיגון כתובות";

/* Geocoding: core: returned when some internal engine error occurs */
"Locator internal error" = "שגיאה פנימית במגדיר עיגון כתובות";

/* Geocoding: core: used when client tried to geocode intersections while locator does not support it */
"Intersections geocoding is not supported by locator" = "עיגון צמתים לא נתמך על ידי מגדיר עיגון הכתובות";

/* Geocoding: core: returned when some locator property is not valid */
"Invalid locator properties" = "מאפייני מגדיר עיגון כתובות לא תקין";

/* Geocoding: core: used when client did not set required field for address geocoding */
"Required field is missing" = "חסר שדה חובה";

/* Geocoding: core: used when operation is performed over uninitialized locator */
"Locator is not initialized" = "מגדיר עיגון כתובות לא אותחל";

/* Geocoding: core: returned when locator format is not supported */
"Unsupported locator format" = "פורמט מגדיר עיגון כתובות לא נתמך";

/* Geocoding: core: returned when geocoding engine cannot make projection transformation */
"Unsupported projection transformation" = "המרת היטל לא נתמכת";

/* Geocoding: core: used when given spatial reference is not supported */
"Unsupported spatial reference" = "ייחוס מרחבי לא נתמך";

/*Geocoding: core: used when locator being used does not support reverse geocoding */
"Reverse geocoding not supported with this locator." = "מציאת כתובת לפי מיקום אינה נתמכת במגדיר עיגון הכתובות הזה";

/* Network analyst errors */
"Cannot open network." = "לא ניתן לפתוח רשת";
"Cannot retrieve route task parameters." = "לא ניתן לקבל מאפייני משימת מסלול";
"Insufficient number of stops." = "מספר לא מספיק של עצירות.";
"Stop (%@) was not located." = "לא נמצאה עצירה (%@).";
"Stop (%@) is located on a non traversable element." = "עצירה (%@) מוקמה בשטח לא עביר.";
"Stop (%@) is located on a soft restricted element." = "עצירה (%@) מוקמה בשטח מוגבל במידה מסויימת.";
"Point barrer (%@) was not located." = "לא אותרה נקודת מחסום.";
"Point barrier (%@) has invalid added cost attribute name." = "לנקודת המחסום (%@) יש שם מאפיין עלות נוספת לא תקין.";
"Line barrier (%@) has invalid scaled cost attribute name." = "לקו החוסם (%@) יש שם מאפיין עלות מבוסס קנ//\"מ  לא תקין.";
"Line barrier (%@) does not cover any network elements." = "הקו החוסם (%@) לא מכסה כל אלמנטים של הרשת.";
"Polygon barrier (%@) has invalid scaled cost attribute name." = "לפוליגון החוסם (%@) יש שם מאפיין עלות מבוסס קנ//\"מ  לא תקין.";
"Polygon barrier (%@) does not cover any network elements." = "הפוליגון החוסם  (%@) לא מכסה כל אלמנטים של הרשת.";
"'%@' is an invalid impedance attribute." = "'%@' הוא מאפיין מעכב לא חוקי.";
"'%@' restriction attribute is invalid." = "מאפיין המגבלה '%@' לא חוקי.";
"'%@' accumulate attribute is invalid." = "מאפיין מצטבר '%@' אינו חוקי.";
"'%@' is an invalid directions time attribute." = "'%@' הינו מאפיין זמני כיוונים לא חוקי.";
"Directions distance attribute is invalid." = "מאפיין מרחקי כיוונים לא חוקי.";
"Invalid attribute parameter attribute name (%@)." = "שם מאפיין (%@) של מאפיין הפרמטר אינו חוקי.";
"Invalid attribute parameter parameter name (%@)." = "שם מאפיין (%@) הפרמטר אינו חוקי.";
"Invalid value type for attribute (%1$@) parameter (%2$@)." = "סוג ערך עבור מאפיין (%1$@) פרמטר (%2$@) לא תקין.";
"Invalid restriction usage value for attribute (%1$@) parameter (%2$@)." = "שימוש לא תקין בערך מגביל למאפיין (%1$@) פרמטר (%2$@).";
"Neutral restriction usage value for attribute (%1$@) parameter (%2$@)." = "שימוש נייטרלי בערך מגביל למאפיין (%1$@) פרמטר (%2$@).";
"Soft restricted element (%@) was traversed." = "נחצה אלמנט עם הגבלה ברמה נמוכה (%@).";
"The network does not have a hierarchy attribute for performing hierarchical route planning." = "לרשת אין מאפיין היררכיה לביצוע תכנון מסלול לפי היררכיות.";
"No path can be found between a given pair of stops (%@)." = "לא נמצא נתיב בין צמד עצירות (%@).";
"The input spatial reference is undefined." = "הייחוס המרחבי שהוכנס לא מוגדר.";
"The output spatial reference is undefined." = "הייחוס המרחבי לייצוא לא הוגדר.";
"The directions style is invalid." = "הסגנון של הכיוונים לא תקין.";
"The directions language is invalid." = "שפת הכיוונים לא תקינה.";
"Directions time and distance attributes do not match." = "זמני כיוונים ומאפייני מרחקים לא תואמים.";
"The directions road class attribute is invalid." = "מאפיין קבוצת כיווני דרך לא תקין.";
"Unknown condition." = "תנאי לא ידוע.";
"Invalid route task parameters." = "פרמטרי משימת מסלול לא תקינים.";
"Route task's solution cannot be found." = "לא נמצא פתרון של משימת מסלול.";
"Route task was cancelled." = "משימת מסלול בוטלה.";
"Route task internal error." = "שגיאה פנימית של משימת מסלול.";
"Route name property is not supported for local route task." = "מאפיין שם מסלול לא נתמך למשימת מסלול מקומית.";
"Local route task parameters should be retrieved from route task." = "הפרמטרים של משימת מסלול מקומית צריכים להישלף מתוך משימת מסלול.";
"Cannot retrieve network description." = "לא ניתן לשלוף את תיאור הרשת.";
"Only one length attribute can be specified for impedanceAttributeName and accumulateAttributeNames." = "ניתן להגדיר רק מאפיין אורך אחד עבור impedanceAttributeName ו- accumulateAttributeNames.";
"Only one time attribute can be specified for impedanceAttributeName and accumulateAttributeNames." = "ניתן להגדיר מאפיין זמן אחד בלבד עבור impedanceAttributeName ו- accumulateAttributeNames.";
"Service not supported." = "שירות לא נתמך.";
"Specified start time occurs before January 1, 1970." = "זמן ההתחלה הוגדר לפני ה-1 בינואר 1970.";
"Stop (%@) has a start time that occurs before January 1, 1970." = "לעצירה (%@) יש זמן התחלה לפני ה-1 בינואר 1970.";
"Stop (%@) has a local time window that starts before January 1, 1970." = "לעצירה (%@) יש חלון זמן מקומי שהתחיל לפני ה-1 בינואר 1970.";
"Stop (%@) has a UTC time window that starts before January 1, 1970." = "לעצירה (%@) יש חלון זמן UTC שהתחיל לפני ה-1 בינואר 1970.";
"Stop (%@) has a time window end that occurs before its time window start." = "לעצירה (%@) יש חלון זמן שהסתיים לפני שהתחיל.";

/* Unit Abbreviated strings */
"cm" = "סמ";
"dd" = "dd";
"dm" = "דצימטר";
"ft" = "ft";
"in" = "אינצ'";
"km" = "ק\"מ";
"m" = "מ'";
"mi" = "mi";
"mm" = "ממ";
"nm" = "nm";
"pt" = "pt";
"Unknown" = "לא ידוע";
"yd" = "יארדים";

/* Unit Display Strings */
"Centimeters" = "סנטימטרים";
"Decimal Degrees" = "מעלות עשרוניות";
"Decimeters" = "דצימטרים";
"Feet" = "רגל";
"Inches" = "אינצ''ים";
"Kilometers" = "קילומטרים";
"Meters" = "מטרים";
"Miles" = "מיילים";
"Millimeters" = "מילימטרים";
"Nautical Miles" = "מיילים ימיים";
"Points" = "נקודות";
"Yards" = "יארד";

/* Area Units Abbreviated Strings */
"sq. in" = "אינטש רבוע";
"sq. ft" = "רגל רבוע";
"sq. yd" = "יארד רבוע";
"ac" = "אקר";
"sq. mi" = "מייל רבוע";
"sq. mm" = "מילימטר רבוע";
"sq. cm" = "סנטימטר רבוע";
"sq. dm" = "דצימטר רבוע";
"sq. m" = "מטר רבוע";
"ares" = "עשיריות דונם";
"ha" = "הקטר";
"sq. km" = "קילומטר רבוע";

/* Area Units Display Strings */
"Square Inches" = "אינטשים רבועים";
"Square Feet" = "רגל רבוע";
"Square Yards" = "יארדים רבועים";
"Acres" = "אקרים";
"Square Miles" = "מילים רבועים";
"Square Millimeters" = "מילימטרים רבועים";
"Square Centimeters" = "סנטימטרים רבועים";
"Square Decimeters" = "דצימטרים רבועים";
"Square Meters" = "מטרים רבועים";
"Ares" = "עשיריות דונם";
"Hectares" = "הקטרים";
"Square Kilometers" = "קילומטרים רבועים";

/* Errors */
"Error" = "שגיאה";
"Class not @protocol AGSJSONSerializable compliant" = "Class not @protocol AGSJSONSerializable compliant";
"Authorization required" = "נדרשת הרשאה";
"Token is invalid or has expired" = "קוד הרישוי (token) לא תקין או פג תוקף";
"Unknown error occurred" = "ארעה שגיאה לא מוכרת";
"Empty username/password" = "שם משתמש/סיסמא ריקים";
"Token URL is nil. You must set a valid token URL on the credential." = "כתובת URL של קוד הרישוי (token) הינו nil. עליך להכניס כתובת URL תקינה של קוד הרישוי (token)  באישורים.";
"Unknown authentication error" = "שגיאת אימות לא ידועה";
"Error extracting identity" = "שגיאה בשליפת זהות";
"Error adding identity to the keychain" = "שגיאה בהוספת זהות ל- keychain";
"Invalid Credentials" = "אישורים לא תקינים";
"Bad URL." = "כתובת URL לא טובה.";
"The feature layer does not expose an object-id field." = "שכבת הישויות לא חושפת את שדה ה- object-id.";
"Both geodatabase and syncParams are required for this method." = "הן ה- geodatabase והן ה- syncParams נדרשים לשיטה זו.";
"Uploading deltas is not supported with this replica." = "טעינת דלתאות לא נתמכת ברפליקה זו.";
"Error creating delta geodatabase" = "שגיאה ביצירת geodatabase עבור הדלתא";
"Unable to create result image layer" = "לא ניתן ליצור שכבת תוצאה מסוג תמונה";
"Cache at path '%@' not found." = "ה- Cache בנתיב '%@' לא נמצא.";
"To add an item, you must be logged in to the portal." = "בכדי להוסיף פריט, עליך להיות מחובר לפורטל.";
"To add an item, you must specify a value in the AGSPortalItemContentParameters." = "בכדי להוסיף פריט, עליך להגדיר ערך ב- AGSPortalItemContentParameters.";
"The portal failed to add the item." = "הוספת הפריט לפורטל נכשלה";
"To delete an item, you must be logged in to the portal." = "בכדי למחוק את הפריט, עליך להיות מחובר לפורטל.";
"The portal failed to delete the item." = "מחיקת הפריט בפורטל נכשלה";
"To update an item, an itemId and logged in user are required." = "בכדי לטעון את הפריט, נדרש מילוי של חיבור משתמש ו- itemId.";
"The item failed to update." = "עדכון הפריט נכשל.";
"The item failed to update JSON." = "הפריט נכשל בעדכון JSON.";
"You must be logged in to a portal to add a comment." = "עליך להיות מחובר לפורטל בכדי להוסיף הערה.";
"The comment failed to be added." = "הוספת ההערה נכשלה.";
"You must be logged in to a portal to fetch the current user's rating." = "עליך להיות מחובר לפורטל בכדי להביא את הדירוג הנוכחי של המשתמש.";
"You must be logged in to a portal to add a rating." = "עליך להיות מחובר לפורטל בכדי להוסיף דירוג.";
"The rating failed to be added." = "נכשל בהוספת הדירוג.";
"To share an item, you must be logged in to the portal." = "בכדי לשתף את הפריט, עליך להיות מחובר לפורטל.";
"To unshare an item, you must be logged in to the portal and specify groups with which to unshare the item." = "לביטול השיתוף של הפריט, עליך להיות מחובר לפורטל ולהגדיר את הקבוצות שינותקו מהשיתוף.";
"Bad Request" = "בקשה לא תקינה";
"Credential Required" = "נדרש AGSCredential";
"Job not created" = "לא נוצר תהליך";
"Service did not return a valid URL" = "השירות לא החזיר URL תקין";
"Service did not return a file" = "השירות לא החזיר קובץ";
"Service did not return a size" = "השירות לא החזיר גודל";
"Job failed" = "העבודה נכשלה";
"Job timed out" = "זמן העבודה פג";
"Job was cancelled" = "העבודה בוטלה";
"Job was deleted" = "העבודה נמחקה";
"Feature with objectId: %d not found" = "לא נמצאה ישות עם objectId: %d";
"No object-id values specified for feature table query." = "לא מוגדרים ערכי object-id לשאילתת טבלת הישויות.";

/* OAuth */
"The specified clientID is invalid" = "מזהה הלקוח המצויין לא חוקי";

/* Sync */
"Upload is not supported with this service." = "העלאה אינה נתמכת עם שירות זה.";
"In order to call sync, a sync direction other than AGSGDBSyncDirectionNone must be specified." = "על מנת להפעיל סינכרון יש להגדיר כיוון סינכרון שונה מ- AGSGDBSyncDirectionNone.";